Revit 2027 API
FabricSheetType.IsCustom Method
 Verifies if the type is Custom Fabric Sheet
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCustom()
Public Function IsCustom As Boolean
public:
bool IsCustom()
member IsCustom : unit -> bool
Return Value
Boolean
 True if Layout is set on Custom and if the wireArr is not null
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace